L = list()

# заполнение списка товаров
i = 1;
while True:
    SKU = {"Название": "", "Цена": 0, "Количество": 0, "ед": "шт"}
    SKU["Название"] = input("Введите название товара: ")
    SKU["Цена"] = int(input("Введите цену товара: "))
    SKU["Количество"] = int(input("Введите количество товара: "))
    SKU["ед"] = input("Введите единицу измерения товара: ")

    L.append((i, SKU))

    if input("Ввести еще один товар? (Enter): ") != "":
        break
    else:
        i += 1

print("\nOriginal list:")
print(L)

# построение аналитики
A = {"Название": [], "Цена": [], "Количество": [], "ед": []}

for item in L:
    A["Название"].append(item[1]["Название"])
    A["Цена"].append(item[1]["Цена"])
    A["Количество"].append(item[1]["Количество"])
    A["ед"].append(item[1]["ед"])

print("\nAnalytics:")
print(A)
